byAlex_regularPorousMedia-master/singlePhase/RmaxRmin/src/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

rho             rho             [1 -3 0 0 0 0 0]    1000;

nu              nu              [0 2 -1 0 0 0 0]    1e-06;

channelLength   channelLength   [0 1 0 0 0 0 0]     0;

// ************************************************************************* //
