byAlex_regularPorousMedia-master/singlePhase/RmaxRmin/src/system/STL_list
channelWall.stl         {type triSurfaceMesh;name channelWall;}
planeChannel3D.stl      {type triSurfaceMesh;name planeChannel3D;}
