byAlex_regularPorousMedia-master/singlePhase/RmaxRmin/src/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         simpleFoam;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             300;

deltaT              1;

writeControl        timeStep;

writeInterval       20;

purgeWrite          2;

writeForma          ascii;

writePrecision      10;

writeCompression    no;

timeFormat          general;

timePrecision       6;

runTimeModifiable   true;

libs (
    "libOpenFOAM.so"
);

functions
{
    /*CLI*/
    #includeFunc    residuals
    #includeFunc    flowRatePatch(name=inlet)
    #includeFunc    flowRatePatch(name=outlet)
    /*CodeStream section*/
//     #include        "inputOutputMassFlowLUFO"
    #include        "permeabilityLUFO"
}

// ************************************************************************* //
