byAlex_regularPorousMedia-master/singlePhase/RmaxRmin/src/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
        nSweeps         1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors    2;
    consistent                  yes;

    residualControl
    {
        p                       1e-6;
        U                       1e-6;
    }
}

relaxationFactors
{
//     fields
//     {
//         p                       0.2;
//     }

    equations
    {
        U                       0.9;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors    10;
}

cache
{
    grad(U);
}

// ************************************************************************* //
