byAlex_regularPorousMedia-master/singlePhase/RmaxRmin/src/system/mapFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mapFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// List of pairs of source/target patches for mapping
patchMap
(
    inlet inlet
);

// List of target patches cutting the source domain (these need to be
// handled specially e.g. interpolated from internal values)
cuttingPatches
(
    channelWall
    outlet
);

// ************************************************************************* // 
