byAlex_regularPorousMedia-master/singlePhase/RmaxRmin/src/system/refinementSurfaces_list
channelWall    {level (4 4); patchInfo{type wall;}}
